app/controllers/campaign_controller.rb

SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 3)
SELECT * FROM "states" WHERE ("states"."campaign" = 2)
---
  def index
    @campaign = Campaign.find(params[:id])
    @states = State.find_all_by_campaign(@campaign.id)